```json
[{'title': 'Remote Java Software Engineer Jobs (NOW HIRING) - ZipRecruiter', 'url': 'https://www.ziprecruiter.com/Jobs/Remote-Java-Software-Engineer', 'content': 'Remote, OR • Remote. $51.75 - $71 / hr. Estimated pay. Title: Software Engineer (Azure Native, Springboot Microservices, Java) Position: Contract to Hire', 'score': 0.4450718}, {'title': 'Software Engineer, AI Platform (FULLY REMOTE)-US Citizenship ...', 'url': 'https://www.splunk.com/en_us/careers/jobs/software-engineer-ai-platform-32073.html', 'content': "Benefits are an important part of Splunk's Total Rewards package. This role is eligible for a competitive benefits package which includes medical, dental, vision, a 401(k) plan and match, paid time off and much more! Learn more about our next-level benefits at https://splunkbenefits.com.\n\nSplunk's Hiring Practices\n\nDIVE DEEPER\n\nFind out what makes Splunk such a great place to work\n\nSplunkers are encouraged and empowered to be Innovative, passionate, disruptive, open and fun. [...] and may be eligible for equity or long-term cash awards. [...] Our benefits are designed to support your physical, financial, emotional and mental wellbeing.\n\nIntern with people you want to hang out with, even outside the office.\n\nOur Blog\n\nHear from Splunkers on the latest.\n\nLearn about Splunk’s commitment to creating a culture of belonging.\n\nFollow Splunk on LinkedIn for job announcements, company news and more.\n\n© 2005 - 2025 Splunk LLC All rights reserved.", 'score': 0.32267588}, {'title': 'Azure Ai Engineer Jobs, Employment in Remote | Indeed', 'url': 'https://www.indeed.com/q-azure-ai-engineer-l-remote-jobs.html', 'content': 'azure ai engineer jobs in remote. 300+ jobs. Conversational AI Engineer (AI Azure Cognitive Services/CLU) ... Machine Learning EngineerSenior Software Engineer', 'score': 0.3216842}, {'title': 'Lead Machine Learning Engineer – AI/ML (Remote Work Option)', 'url': 'https://jobs.nike.com/job/R-38652', 'content': 'Rest and recovery are critical for you to be able to deliver at peak performance. You can count on us to walk\n                        the talk,\n                        providing resources and time that help keep life balanced and yourself fueled for any challenge. Compassion\n                        and\n                        flexibility enhance the supportive nature of our community.\n\nPURPOSE AT PLAY [...] We offer a number of accommodations to complete our interview process including screen readers, sign language interpreters,\n                accessible and single location for in-person interviews, closed captioning, and other reasonable modifications as\n                needed. [...] Agility is our edge. We put the consumer first by setting the pace, acting decisively and driving change to meet their\n                                            needs.\n\nDo the Right Thing\n\nWe value our unique opportunity to put ethics into action on the journey to level the playing field for all. This requires accountability, meaning we consistently make calls and own the results.\n\nWin as a Team', 'score': 0.28470573}, {'title': '6,000+ Remote Machine Learning Engineer jobs in United States ...', 'url': 'https://www.linkedin.com/jobs/remote-machine-learning-engineer-jobs', 'content': 'Software Engineer I. Software Engineer I. Spark. New York, NY 2 days ago. 100% Remote Role - AI/ML Engineer. 100% Remote Role - AI/ML Engineer. Vinsys', 'score': 0.24619834}]
```